🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / env0-starter (env0-starter)](https://app.env0.com/p/7334f071-189b-4916-91e3-b217bc7d5a54/environments/6de7cc02-e4cb-4514-903d-29b1f542fbc3):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.test must be replaced
-/+ resource "google_storage_bucket" "test" {
-       default_event_based_hold    = false -> null
!       effective_labels            = {} -> (known after apply)
-       enable_object_retention     = false -> null
!       id                          = "julian-env0-poc-test" -> (known after apply)
-       labels                      = {} -> null
!       name                        = "julian-env0-poc-test" -> "julian-env0-poc-test-renamed" # forces replacement
!       public_access_prevention    = "inherited" -> (known after apply)
-       requester_pays              = false -> null
+       rpo                         = (known after apply)
!       self_link                   = "https://www.googleapis.com/storage/v1/b/julian-env0-poc-test" -> (known after apply)
!       terraform_labels            = {} -> (known after apply)
!       uniform_bucket_level_access = false -> (known after apply)
!       url                         = "gs://julian-env0-poc-test" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>


```
Failed to calculate cost estimation
```

To *apply* this plan, use the following comment:
```
env0 apply -e env0-starter
```


[Full PR Plan logs on env0](https://app.env0.com/p/7334f071-189b-4916-91e3-b217bc7d5a54/environments/6de7cc02-e4cb-4514-903d-29b1f542fbc3/deployments/b3c2803c-0eac-47c6-864e-a72c79f1774a)